Revit 2027 API
ViewSchedule.IsValidFamilyForNoteBlock Method
 Checks whether a family can be used for a note block.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFamilyForNoteBlock(
	Document document,
	ElementId familyId
)
Public Shared Function IsValidFamilyForNoteBlock (
	document As Document,
	familyId As ElementId
) As Boolean
public:
static bool IsValidFamilyForNoteBlock(
	Document^ document,
	ElementId^ familyId
)
static member IsValidFamilyForNoteBlock :
        document : Document *
        familyId : ElementId -> bool
Parameters
document Document
 The document.
familyId ElementId
 The family ID to check.
Return Value
Boolean
 True if the family can be used for a note block, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace